elbow-fchannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
       leftRightWallsright
    {
        type            cyclicAMI;
    }
    outlet
    {
        type            zeroGradient;
    }
    channelWallsright
    {
        type            fixedValue;
        value           uniform 0;
    }
    destinationFaceright
    {
        type            zeroGradient;
    }
    sourceFaceright
    {
        type            zeroGradient;
    }
    sourceFaceleft
    {
        type            zeroGradient;
    }
    destinationFaceleft
    {
        type            zeroGradient;
    }
    channelWallsleft
    {
        type            zeroGradient;
    }
    leftRightWallleft
    {
        type            cyclicAMI;
    }
    inlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
