elbow-fchannel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftRightWallsright
    {
        type            cyclicAMI;
    }
    outlet
    {
        type            zeroGradient;
    }
    channelWallsright
    {
        type            noSlip;
    }
    destinationFaceright
    {
        type            noSlip;
    }
    sourceFaceright
    {
        type            noSlip;
    }
    sourceFaceleft
    {
        type            noSlip;
    }
    destinationFaceleft
    {
        type            noSlip;
    }
    channelWallsleft
    {
        type            noSlip;
    }
    leftRightWallleft
    {
        type            cyclicAMI;
    }
    inlet
    {
        type            fixedValue;
        value           uniform(0 0 0);
    }

}

// ************************************************************************* //
